# insert

In [4]:
import pandas as pd
var = pd.DataFrame({"a":[1,2,3,4,5],"b":[9,8,7,6,5]})
var

   a  b
0  1  9
1  2  8
2  3  7
3  4  6
4  5  5

In [6]:
var["python_12"]=var["a"][:3]

In [7]:
var

   a  b  python_12
0  1  9        1.0
1  2  8        2.0
2  3  7        3.0
3  4  6        NaN
4  5  5        NaN

# delete

In [8]:
var.pop("python_12")

0    1.0
1    2.0
2    3.0
3    NaN
4    NaN
Name: python_12, dtype: float64

In [9]:
var

   a  b
0  1  9
1  2  8
2  3  7
3  4  6
4  5  5

In [10]:
del var["a"]

In [11]:
var

   b
0  9
1  8
2  7
3  6
4  5